VeijoPesonen/fw-nrfconnect-nrf/lib/nrf91_lwm2m_app/lwm2m/lwm2m_device.c
/*
 * Copyright (c) 2021 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <zephyr.h>
#include <version.h>
#include <logging/log_ctrl.h>
#include <power/reboot.h>
#include <net/lwm2m.h>
#include "pm_config.h"
#include <net/nrf91_lwm2m_app.h>

#include <logging/log.h>
LOG_MODULE_REGISTER(lwm2m_device, CONFIG_NRF91_LWM2M_APP_LOG_LEVEL);

#define REBOOT_DELAY K_SECONDS(1)

static struct k_delayed_work reboot_work;

static void reboot_work_handler(struct k_work *work)
{
	LOG_PANIC();
	sys_reboot(0);
}

static int device_reboot_cb(uint16_t obj_inst_id, uint8_t *args,
			    uint16_t args_len)
{
	ARG_UNUSED(args);
	ARG_UNUSED(args_len);

	LOG_INF("DEVICE: Reboot in progress");

	k_delayed_work_submit(&reboot_work, REBOOT_DELAY);

	return 0;
}

int lwm2m_init_device(void)
{
	k_delayed_work_init(&reboot_work, reboot_work_handler);

	lwm2m_engine_register_exec_callback("3/0/4", device_reboot_cb);

	return 0;
}
